## Numpy: NUMerical PYthon 

This is Python's stack for scientific computing. The fundamental new data type is that of a **numpy array**, Python's matrix(tensor)-type object, which is used in the majority of Python's modules for Data Analysis, Statistics and Machine Learning  - for example in order to feed data into `sklearn` functions

numpy arrays contain data all of the same type (*dtype*), numerical of many types or boolean

The coordinates are known as axes

In [7]:
# import module 
import numpy as np

To create an array we use the np.array() function

In [8]:
# creating an array
a = np.array([[1, 2, 3, 4, 5, 6], 
              [42, 53, 43 ,62, 7, 4], 
              [-3, -1, -4 ,-8, -52, -4], 
              [10, 0, 4 , 1, 0, 1]])

We can access the elements in an array using multi-index notation, familiar in small variations in many computing environments and languages - with the usual Pythonic conventions, e.g., counting starts from 0, slicing a:b is inclusive:exclusive, negative indices, etc

What do you think the following piece of code does? 

```python
print(a[-2:,[2,4]])
```

### Array attributes

The array data type has its own attributes. Some worth highlighting are:

+ Shape
```python
arrayname.shape # returns the shape as tuple, e.g. (4,6)
arrayname.reshape(arg) # returns a new array with the same data as those in arrayname but organized in different shape - read carefully defaults
```
+ Aggregations
```python
arrayname.function(arg) # e.g. function could be sum, max, min, etc. args can be used to specify operation over all elements, or for an axis, etc  - this is much more efficient than looping
```
+ Linear algebra
```python
arrayname.transpose(arg)  # transpose - even for multi-d arrays
arrayname.diagonal(arg) # diagonal elements as array
arrayname.dot(anotherarray) # dot product
```

## Array operations

Remember that to concatenate two lists in Python, we could use the "+" operator. 

This is not the case in Numpy!

Mathematical symbols take on mathematical meanings in Numpy. Thus, the "+" operator between two Numpy Arrays actually just attempts to add them together, elementwise.

In [9]:
# Numpy array addition: 

a,b = np.array([1,2,3]), np.array([4,5,6])
a + b

array([5, 7, 9])

In [10]:
# Numpy array concatenation: 

np.concatenate([a,b])

array([1, 2, 3, 4, 5, 6])

# Data analysis with Python

PANDAS: Panel Data Structures 

This is the module in Python for doing rectangular-data management, analysis and plotting.

The first set of tools are to read and write.

## Loading data into Python 

<img src="io_tools.png"> 

See [IO DOC](https://pandas.pydata.org/pandas-docs/stable/io.html) in Python for more information

Lets load our first dataset (and load all we need to get working!)

In [11]:
import pandas as pd

# load a dataframe from disk
tips = pd.read_csv("tips.csv")
tips.head(5)

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4

## Series and DataFrame

These are the two basic data formats in PANDAS, the equivalent of column and rectangular data structures, as in linear algebra (vector/matrix) but equipped with several attributes invaluable for data management and analysis

In the *tips* example, the variable "tips" is a DataFrame, while any individual column would be a Series.

## Series 

This is a 1-d data structure with *values* accessed via their index. 

Unlike in raw Python or Numpy, however, Series indices can be made up of either: 
+ *numbers*: which could be ordered and contiguous like a Python list, but don't have to be! 
+ *strings*: essentially labels, like the keys in a dictionary

Although typically a series is obtained by reading a dataset from an external file or when doing operations on dataframes, we can still define one manually by specifying the values and the indices. 

Let's do this an get an insight into how it works

In [12]:
# here no indices are specified, there are defaults
my_series = pd.Series([1, 15, -5, None, 4, 123, 0, 78, 0, 5, -4])

In [13]:
# Accessing a certain value via the index

my_series[0]

1.0

In [14]:
# Note that there are a bunch of attributes.
# .values returns a numpy ndarray of the values! 

my_series.values

array([  1.,  15.,  -5.,  nan,   4., 123.,   0.,  78.,   0.,   5.,  -4.])

In [15]:
# Take a look at the index. What type is it? 
# You convert itto a numpy ndarray by adding ".values" again!

my_series.index

RangeIndex(start=0, stop=11, step=1)

In [16]:
# You can overwrite the index directly: 

my_series.index = ["om","ir","os","pap","pas","pil","io","po","ulos","is","best"]

my_series

om        1.0
ir       15.0
os       -5.0
pap       NaN
pas       4.0
pil     123.0
io        0.0
po       78.0
ulos      0.0
is        5.0
best     -4.0
dtype: float64

## iloc

Accessing values via the index can be very useful, but sometimes you want to access the values as though they were a Python list. In other words "I want the first value!", without having to know the name of the label. 

This can be achieved with .iloc: 

```python
my_series.iloc[0]
```

In [17]:
# Series that have string indices can also be accessed via a RangeIndex
# (which is similar to the index of a regular Python list)

my_series.iloc[0], my_series["om"]

(1.0, 1.0)

In [18]:
# Note that indices can get moved around, by sorting for example!
# iloc gives you the element you would get if the Series
# was a list and you were giving it the index:

# This just resets the index to be as we found it originally
my_series = my_series.reset_index(drop=True)

x = my_series.sort_values()

x[0], x.iloc[0]

(1.0, -5.0)

## Operations with series

Because Series are Numpy arrays behind the scenes, we can compute element-wise functions on one series or several series at the same time. The result is another series with data type depending on the type of operations performed. 

For example, what do you think the following piece of code will do:

In [19]:
Series1 = pd.Series([1,3,5,7])
Series2 = pd.Series([0,10,-1,6])

Series3 = 2*Series1 + abs(Series2)

Series4 = Series1 > Series2 

# Take a look at the different Series objects!
Series4

0     True
1    False
2     True
3     True
dtype: bool

## Data alignment 

What goes on in the previous examples is more subtle than it looks. How does Python know which elements from each series to join in the required operation together?  

What happens is that the indices happened to be the same. So when we ask something like 

```python
Series3 = Series1 + Series2 
```

Python looks for entries in each series with the same index and then does an elementwise summation that it stores in a like-wise index in Series 3. 

Consider instead the following example

In [20]:
Series1 = pd.Series([1,10],index=["om","iros"])
Series2 = pd.Series([4,-1],index=["pap","as"])
Series3 = Series1 + Series2
Series3

as     NaN
iros   NaN
om     NaN
pap    NaN
dtype: float64

This aspect makes it very easy to work with series that we have sorted or manipulated otherwise; there is always the address to access a value. This helps prevent accidentally combining values we didn't mean to combine!

## Basic information retrieval with series

+ Accessing single elements
+ Slicing; accessing a set of elements
+ Filtering; selection by  boolean index

Recalling that operations on Series returns Series, the big news here is that we can access values in a Series by specifying 

+ single index
+ a slice (a:b for integers a,b) 
+ list (or Numpy Array or Series) of index labels
+ a boolean Series (also called a _boolean mask_) 

Interesting: the result of any such retrieval (except for a single index) is a series itself!

In [21]:
# accesing by list of index labels

my_series.index = ["om","ir","os","pap","pas","pil","io","po","ulos","is","best"]
x = my_series[["om","pap"]]
x

om     1.0
pap    NaN
dtype: float64

In [22]:
# getting a boolean-valued series by checking a condition

choose = my_series == 0.0
choose

om      False
ir      False
os      False
pap     False
pas     False
pil     False
io       True
po      False
ulos     True
is      False
best    False
dtype: bool

In [23]:
# Notice the index of x is a SUBSET of the index of "my_series"
# This can be useful when needing to relate values back to the original "my_series"!

x = my_series[choose]
x

io      0.0
ulos    0.0
dtype: float64

## Filtering via boolean masks

We often use boolean masks to filter data in Pandas. Series that are of type "bool" thus take on special significance: we use them a lot!

We also get special boolean algebra operators to use in Numpy/Pandas, distinct from the and/or/not you will use in regular Python: 


```python
& # AND
| # OR
~ # NOT
```

In [24]:
# Challenge: 

# Filter "my_series" to be all the elements that are NOT
# equal to 0, using the "choose" boolean mask below: 

choose = my_series == 0.0
my_series[my_series != 0]
my_series[~choose]

om        1.0
ir       15.0
os       -5.0
pap       NaN
pas       4.0
pil     123.0
po       78.0
is        5.0
best     -4.0
dtype: float64

## Coding and managing missing values

A series object in PANDAS can deal with maybe the most important type of data of all for data analysis: missing data! 

We already see very naturally how data management leads to missing data rather immediately. Recall the earlier attempt to sum up to Series

```python
Series3 = Series1+Series2
print(Series3)
as     NaN
iros   NaN
om     NaN
pap    NaN
dtype: float64
```
What happened there is that in the operation labels could not be matched, so pandas tried to sum a numeric value with a missing value, the result of which is a missing value!

The way to manually specify in PANDAS that a value is missing is to use use None, as below: 

```python
temp = pd.Series([1,None,2])
print(temp)
0    1.0
1    NaN
2    2.0
dtype: float64
```
If the Series is numeric, Pandas will caste it to numpy.float64 type and convert the None values to Numpy NaN values (Not a Number). If the Series is of type "object" (arbitrary Python objects), it will keep the values as None.

We can create *boolean masks* on the basis of such values. The way to identify NaN or None values in a Series is to use either of the equivalent two attributes

```python
seriesname.isna()
seriesname.isnull()
```

Either returns a boolean-valued series that we can use then for selecting and operating on NaN or the rest of the values. The opposite also exists: 

```python
seriesname.notna()
seriesname.notnull()
```

In [25]:
# Challenge: 
# Get a list of names, without the Null values!

# The Pandas way: 
# 1. Create a boolean mask by using the .notna() method.
# 2. Use the mask to subset the Series.

names = pd.Series(['foo','bar',None,'baz','qux',None])
names[names.notna()]

0    foo
1    bar
3    baz
4    qux
dtype: object

## Highlighting some important series attributes & methods

As usual one should explore the attributes of any python object one ends up working with. We have already accessed the seriesname.index and seriesname.value

Some other (among many!) that are worth highlighting: 

+ .map
+ .corr 
+ .describe
+ .hist
+ .plot
+ .size
+ .value_counts
+ .sort_values

In [26]:
# Challenge: 

# Use the "map" method to create a new series with each element
# lowercased. Create your own function to do the operation. 
# Missing values should stay missing!


def lower(s):
    # Your code here
    # HINT: delete the "pass" when your done
    # HINT2: handle None values!
    try:
        return s.lower()
    except AttributeError:
        return None

names = pd.Series(['Foo', 'BAR', None, 'foo', None, 'bar', 'bAR', 'foo', None])
names_lower = names.map(lower)

In [27]:
# Challenge: 

# Using the series from above, now lowercased, count the occurences of each name
# Hint: It's simple, just use .value_counts()!

names_lower.value_counts()

bar    3
foo    3
dtype: int64

## Dataframes

This is PANDAS model for rectangular data, operationally is like a dictionary of series; each column of the dataframe is a series object, and clearly comes with all the attributes/methods of a series

An implication of the above is that within each column the data type is common; across columns of course this can change

Let's see an example right away

In [28]:
tips = pd.read_csv("tips.csv")
tips.head(10) # the first method of our dataframe object!

   total_bill   tip     sex smoker  day    time  size
0       16.99  1.01  Female     No  Sun  Dinner     2
1       10.34  1.66    Male     No  Sun  Dinner     3
2       21.01  3.50    Male     No  Sun  Dinner     3
3       23.68  3.31    Male     No  Sun  Dinner     2
4       24.59  3.61  Female     No  Sun  Dinner     4
5       25.29  4.71    Male     No  Sun  Dinner     4
6        8.77  2.00    Male     No  Sun  Dinner     2
7       26.88  3.12    Male     No  Sun  Dinner     4
8       15.04  1.96    Male     No  Sun  Dinner     2
9       14.78  3.23    Male     No  Sun  Dinner     2

In [29]:
# the other important attribute: name of rows and columns
tips.index

tips.columns

Index(['total_bill', 'tip', 'sex', 'smoker', 'day', 'time', 'size'], dtype='object')

## Accessing the series embedded within

There are two way to access the information in the columns: 
+ One is to give the name of the column as `dataframename.columnname` 
   + This is not feasible when the name of the column coincides with an attribute or method of the dataframe, e.g. when a column is called "size"  
+ Another is as dataframename["columnname"]

Any of these calls returns a series object with the same index as the dataframe and the values of the column

We can then work with the extracted series as usual. Hence you can understand what happens below 

```python
tips["size"].corr(tips.tip)
```

In a similar fashion, we can access various columns at a time; we need to provide a list of column names in this case; the result is now a dataframe with the same index as the original and columns the chosen subset. We can then work with it using any of the dataframe attributes and methods we know. 

You can now guess what will happen below: 

```python
tips[["tip","size","sex"]].tip.corr(tips["size"])

```
(not saying that this is a sensible code! just trying to make sure we understand the structure)

## Accessing subsets of rows

Now we are interested in a subset of rows. We can access rows by:
+ list of index labels 
  ```python
  dataframename.loc[ [index1, index2, ...] ]
  ```
+ list of integer index location (i-loc) 
  ```python
  dataframename.iloc[ [integer1, integer2, ...] ]
  ```
The output is:
+ a series, if a single column or row is chosen
+ a dataframe, with index label the chosen index labels and the same column names as the dataframe

In the case of .iloc we can also use slices, as for example
```python
dataframename.iloc[3:5]
dataframename.iloc[3:5,:]
dataframename.iloc[3:5,-2:]
```

Note: loc/iloc are also used to access a subset of rows AND columns at the same time. See examples below!

In [30]:
# Accessing rows AND columns!
# Example of 2-dimension loc

tips.loc[[1,3], ['sex', 'smoker']]

    sex smoker
1  Male     No
3  Male     No

In [31]:
# Accessing rows AND columns!
# Example of 2-dimensional iloc

tips.iloc[[1,3], 2:]

    sex smoker  day    time  size
1  Male     No  Sun  Dinner     3
3  Male     No  Sun  Dinner     2

In [32]:
# Challenge:

# Using the tips dataframe, create a new one that contains the 
# information contained in all rows between the 20th (inclusive) 
# and the 45th (exclusive) and only the columns: tip, sex, day

tips.loc[20:45,["tip","sex","day"]]

     tip     sex  day
20  4.08    Male  Sat
21  2.75  Female  Sat
22  2.23  Female  Sat
23  7.58    Male  Sat
24  3.18    Male  Sat
25  2.34    Male  Sat
26  2.00    Male  Sat
27  2.00    Male  Sat
28  4.30    Male  Sat
29  3.00  Female  Sat
30  1.45    Male  Sat
31  2.50    Male  Sat
32  3.00  Female  Sat
33  2.45  Female  Sat
34  3.27    Male  Sat
35  3.60    Male  Sat
36  2.00    Male  Sat
37  3.07  Female  Sat
38  2.31    Male  Sat
39  5.00    Male  Sat
40  2.24    Male  Sat
41  2.54    Male  Sun
42  3.06    Male  Sun
43  1.32    Male  Sun
44  5.60    Male  Sun
45  3.00    Male  Sun

Note that certain operations are exchangeable: the 3rd element of column "sex" can be obtained with either of the following ways: 
```python
tips.sex[2] #access col as series, then the 3rd element of that
tips.loc[2,"sex"] #access the entry in dataframe by giving the index labels of row and col (recall here index labels coincide with numerical indices
tips.loc[2]["sex"] #accessing the whole row as a series, then using the column name as index label
```
etc

## Filtering

As with series, we can use a boolean-valued series to index a dataframe provided the share the same index labels. The simplest instance of this is to use series produced as boolean masks of columns of the dataframe. The output of this *filtering* operation is a dataframe with subset of rows corresponding to the True values in the boolean mask. 

For example, for the tips data, what does the following produce? 
```python
tips[tips.sex == "Male"] 
```

Recall that the boolean operators are 
```python
& # AND
| # OR
~ # NOT

```

## Statistics and computations

dataframe comes with several attributes for computing column-wise statistics and summaries. We highlight some 
```python
.boxplot # check out the "by = " option!
.corrwith & .corr # within and across dataframes!
.dot 
.mean/median/max/quantile/sum etc
.sample 
.sort_values 
```

In [33]:
# Challenge:

# Using the tips dataframe, calculate the correlation between
# tip and size for only Male clients during Dinner. 

# HINT: Remember that "size" cannot be accessed via dot notation, as it's an 
# attribute of the series!
tips[(tips.sex=="Male")&(tips.time=="Dinner")].corr().loc["size","tip"]

0.4046316428033048

## GroupBy

This dataframe method groups the dataframe according to the values of a column, treating them as categorical values; it returns a groupby object!

Groupby objects are useful, but can feel a bit opaque. Let's play around with them a bit:

In [34]:
# Group tips dataframe by size of table
by_size = tips.groupby("size")

by_size

In [35]:
# If we coerce it to a list, we see something interesting: 
# It's basically a list of tuples! 
# The first element is the "category" variable, the second
# is a datafame. 

list(by_size)

[(1,      total_bill   tip     sex smoker   day    time  size
  67         3.07  1.00  Female    Yes   Sat  Dinner     1
  82        10.07  1.83  Female     No  Thur   Lunch     1
  111        7.25  1.00  Female     No   Sat  Dinner     1
  222        8.58  1.92    Male    Yes   Fri   Lunch     1),
 (2,      total_bill   tip     sex smoker   day    time  size
  0         16.99  1.01  Female     No   Sun  Dinner     2
  3         23.68  3.31    Male     No   Sun  Dinner     2
  6          8.77  2.00    Male     No   Sun  Dinner     2
  8         15.04  1.96    Male     No   Sun  Dinner     2
  9         14.78  3.23    Male     No   Sun  Dinner     2
  ..          ...   ...     ...    ...   ...     ...   ...
  237       32.83  1.17    Male    Yes   Sat  Dinner     2
  240       27.18  2.00  Female    Yes   Sat  Dinner     2
  241       22.67  2.00    Male    Yes   Sat  Dinner     2
  242       17.82  1.75    Male     No   Sat  Dinner     2
  243       18.78  3.00  Female     No  Thur  Dinner     2

  [156 rows x 7 columns]),
 (3,      total_bill    tip     sex smoker   day    time  size
  1         10.34   1.66    Male     No   Sun  Dinner     3
  2         21.01   3.50    Male     No   Sun  Dinner     3
  16        10.33   1.67  Female     No   Sun  Dinner     3
  17        16.29   3.71    Male     No   Sun  Dinner     3
  18        16.97   3.50  Female     No   Sun  Dinner     3
  19        20.65   3.35    Male     No   Sat  Dinner     3
  35        24.06   3.60    Male     No   Sat  Dinner     3
  36        16.31   2.00    Male     No   Sat  Dinner     3
  37        16.93   3.07  Female     No   Sat  Dinner     3
  38        18.69   2.31    Male     No   Sat  Dinner     3
  39        31.27   5.00    Male     No   Sat  Dinner     3
  40        16.04   2.24    Male     No   Sat  Dinner     3
  48        28.55   2.05    Male     No   Sun  Dinner     3
  64        17.59   2.64    Male     No   Sat  Dinner     3
  65        20.08   3.15    Male     No   Sat  Dinner     3
  71        17.07   3.00  Female     No   Sat  Dinner     3
  102       44.30   2.50  Female    Yes   Sat  Dinner     3
  112       38.07   4.00    Male     No   Sun  Dinner     3
  114       25.71   4.00  Female     No   Sun  Dinner     3
  129       22.82   2.18    Male     No  Thur   Lunch     3
  146       18.64   1.36  Female     No  Thur   Lunch     3
  152       17.26   2.74    Male     No   Sun  Dinner     3
  162       16.21   2.00  Female     No   Sun  Dinner     3
  165       24.52   3.48    Male     No   Sun  Dinner     3
  170       50.81  10.00    Male    Yes   Sat  Dinner     3
  182       45.35   3.50    Male    Yes   Sun  Dinner     3
  186       20.90   3.50  Female    Yes   Sun  Dinner     3
  188       18.15   3.50  Female    Yes   Sun  Dinner     3
  189       23.10   4.00    Male    Yes   Sun  Dinner     3
  200       18.71   4.00    Male    Yes  Thur   Lunch     3
  205       16.47   3.23  Female    Yes  Thur   Lunch     3
  206       26.59   3.41    Male    Yes   Sat  Dinner     3
  210       30.06   2.00    Male    Yes   Sat  Dinner     3
  214       28.17   6.50  Female    Yes   Sat  Dinner     3
  223       15.98   3.00  Female     No   Fri   Lunch     3
  231       15.69   3.00    Male    Yes   Sat  Dinner     3
  238       35.83   4.67  Female     No   Sat  Dinner     3
  239       29.03   5.92    Male     No   Sat  Dinner     3),
 (4,      total_bill   tip     sex smoker   day    time  size
  4         24.59  3.61  Female     No   Sun  Dinner     4
  5         25.29  4.71    Male     No   Sun  Dinner     4
  7         26.88  3.12    Male     No   Sun  Dinner     4
  11        35.26  5.00  Female     No   Sun  Dinner     4
  13        18.43  3.00    Male     No   Sun  Dinner     4
  23        39.42  7.58    Male     No   Sat  Dinner     4
  25        17.81  2.34    Male     No   Sat  Dinner     4
  31        18.35  2.50    Male     No   Sat  Dinner     4
  33        20.69  2.45  Female     No   Sat  Dinner     4
  44        30.40  5.60    Male     No   Sun  Dinner     4
  47        32.40  6.00    Male     No   Sun  Dinner     4
  52        34.81  5.20  Female     No   Sun  Dinner     4
  54        25.56  4.34    Male     No   Sun  Dinner     4
  56        38.01  3.00    Male    Yes   Sat  Dinner     4
  59        48.27  6.73    Male     No   Sat  Dinner     4
  63        18.29  3.76    Male    Yes   Sat  Dinner     4
  77        27.20  4.00    Male     No  Thur   Lunch     4
  85        34.83  5.17  Female     No  Thur   Lunch     4
  95        40.17  4.73    Male    Yes   Fri  Dinner     4
  116       29.93  5.07    Male     No   Sun  Dinner     4
  119       24.08  2.92  Female     No  Thur   Lunch     4
  153       24.55  2.00    Male     No   Sun  Dinner     4
  154       19.77  2.00    Male     No   Sun  Dinner     4
  157       25.00  3.75  Female     No   Sun  Dinner     4
  159       16.49  2.00    Male     No   Sun  Dinner     4
  160       21.50  3.50    Male     No   Sun  Dinner     4
  167       31.71  4.50    Male     No   Sun  Dinner     4
  180       34.65  3.68    Male    Yes   Sun  Dinner     4
  183       23.17  6.50    Male    Yes   Sun  Dinner     4
  197       43.11  5.00  Female    Yes  Thur   Lunch     4
  204       20.53  4.00    Male    Yes  Thur   Lunch     4
  207       38.73  3.00    Male    Yes   Sat  Dinner     4
  211       25.89  5.16    Male    Yes   Sat  Dinner     4
  212       48.33  9.00    Male     No   Sat  Dinner     4
  219       30.14  3.09  Female    Yes   Sat  Dinner     4
  227       20.45  3.00    Male     No   Sat  Dinner     4
  230       24.01  2.00    Male    Yes   Sat  Dinner     4),
 (5,      total_bill   tip     sex smoker   day    time  size
  142       41.19  5.00    Male     No  Thur   Lunch     5
  155       29.85  5.14  Female     No   Sun  Dinner     5
  185       20.69  5.00    Male     No   Sun  Dinner     5
  187       30.46  2.00    Male    Yes   Sun  Dinner     5
  216       28.15  3.00    Male    Yes   Sat  Dinner     5),
 (6,      total_bill  tip     sex smoker   day    time  size
  125       29.80  4.2  Female     No  Thur   Lunch     6
  141       34.30  6.7    Male     No  Thur   Lunch     6
  143       27.05  5.0  Female     No  Thur   Lunch     6
  156       48.17  5.0    Male     No   Sun  Dinner     6)]

In [36]:
# We can iterate through the groupby just like we would a list of tuples!


for sex,data in tips.groupby("sex"):
    print(sex)
    print(data.mean())

Female
total_bill    18.056897
tip            2.833448
size           2.459770
dtype: float64
Male
total_bill    20.744076
tip            3.089618
size           2.630573
dtype: float64

## Why do we groupby? 

We group by to perform _some_ operation on each group. To _map_ over the groups, applying a function to each element! 

Very often this function is itself an aggregation (reduction). We want to somehow aggregate each group into a value or set of values that _describe_ the group!

How do we apply functions to each element of a groupby? We use a handy method called ".apply"!

In [37]:
# Get the maximum bill by gender: 

def max_bill(df):
    return df.total_bill.max()

tips.groupby("sex").apply(max_bill)

sex
Female    44.30
Male      50.81
dtype: float64

In [38]:
# Challenge: 

# Get the second largest bill by gender!
# HINT: use sort_values and iloc!
def sec_max_bill(df):
    return df.total_bill.sort_values(ascending=False).iloc[1]
tips.groupby("sex").apply(sec_max_bill)

sex
Female    43.11
Male      48.33
dtype: float64

## Built-in Aggregations in groupby

Many aggregation functions that exist on Series and DataFrames (mean, max, min, etc.) can be called directly via the groupby object: 

```python
tips.groupby("sex").max()
tips.groupby("sex").mean()
```

In [44]:
# Challenge: 
# What is the mean tip, per day, for male vs. female?


def day_mean(df):
    # Hint: you will need to group by "day"
    # in this function, then get the mean tip. 
    return df.groupby("day").tip.mean()


tips.groupby("sex").apply(day_mean)

day          Fri       Sat       Sun      Thur
sex
Female  2.781111  2.801786  3.367222  2.575625
Male    2.693000  3.083898  3.220345  2.980333


# Multiple Groupby!

That groupby induction that we just performed, it's quite a common use-case! So there's an even easier way to do it in Pandas. 

We can group by more than one column! 

For example the task we accomplished above could also be derived as: 

```python
tips.groupby(["sex","day"]).tip.mean()
```

In [45]:
# Take a look at the structure of the multiple groupby!

list(tips.groupby(["sex", "day"]))

[(('Female', 'Fri'),      total_bill   tip     sex smoker  day    time  size
  92         5.75  1.00  Female    Yes  Fri  Dinner     2
  93        16.32  4.30  Female    Yes  Fri  Dinner     2
  94        22.75  3.25  Female     No  Fri  Dinner     2
  100       11.35  2.50  Female    Yes  Fri  Dinner     2
  101       15.38  3.00  Female    Yes  Fri  Dinner     2
  221       13.42  3.48  Female    Yes  Fri   Lunch     2
  223       15.98  3.00  Female     No  Fri   Lunch     3
  225       16.27  2.50  Female    Yes  Fri   Lunch     2
  226       10.09  2.00  Female    Yes  Fri   Lunch     2),
 (('Female', 'Sat'),      total_bill   tip     sex smoker  day    time  size
  21        20.29  2.75  Female     No  Sat  Dinner     2
  22        15.77  2.23  Female     No  Sat  Dinner     2
  29        19.65  3.00  Female     No  Sat  Dinner     2
  32        15.06  3.00  Female     No  Sat  Dinner     2
  33        20.69  2.45  Female     No  Sat  Dinner     4
  37        16.93  3.07  Female     No  Sat  Dinner     3
  57        26.41  1.50  Female     No  Sat  Dinner     2
  66        16.45  2.47  Female     No  Sat  Dinner     2
  67         3.07  1.00  Female    Yes  Sat  Dinner     1
  71        17.07  3.00  Female     No  Sat  Dinner     3
  72        26.86  3.14  Female    Yes  Sat  Dinner     2
  73        25.28  5.00  Female    Yes  Sat  Dinner     2
  74        14.73  2.20  Female     No  Sat  Dinner     2
  102       44.30  2.50  Female    Yes  Sat  Dinner     3
  103       22.42  3.48  Female    Yes  Sat  Dinner     2
  104       20.92  4.08  Female     No  Sat  Dinner     2
  109       14.31  4.00  Female    Yes  Sat  Dinner     2
  111        7.25  1.00  Female     No  Sat  Dinner     1
  168       10.59  1.61  Female    Yes  Sat  Dinner     2
  169       10.63  2.00  Female    Yes  Sat  Dinner     2
  209       12.76  2.23  Female    Yes  Sat  Dinner     2
  213       13.27  2.50  Female    Yes  Sat  Dinner     2
  214       28.17  6.50  Female    Yes  Sat  Dinner     3
  215       12.90  1.10  Female    Yes  Sat  Dinner     2
  219       30.14  3.09  Female    Yes  Sat  Dinner     4
  229       22.12  2.88  Female    Yes  Sat  Dinner     2
  238       35.83  4.67  Female     No  Sat  Dinner     3
  240       27.18  2.00  Female    Yes  Sat  Dinner     2),
 (('Female', 'Sun'),      total_bill   tip     sex smoker  day    time  size
  0         16.99  1.01  Female     No  Sun  Dinner     2
  4         24.59  3.61  Female     No  Sun  Dinner     4
  11        35.26  5.00  Female     No  Sun  Dinner     4
  14        14.83  3.02  Female     No  Sun  Dinner     2
  16        10.33  1.67  Female     No  Sun  Dinner     3
  18        16.97  3.50  Female     No  Sun  Dinner     3
  51        10.29  2.60  Female     No  Sun  Dinner     2
  52        34.81  5.20  Female     No  Sun  Dinner     4
  114       25.71  4.00  Female     No  Sun  Dinner     3
  115       17.31  3.50  Female     No  Sun  Dinner     2
  155       29.85  5.14  Female     No  Sun  Dinner     5
  157       25.00  3.75  Female     No  Sun  Dinner     4
  158       13.39  2.61  Female     No  Sun  Dinner     2
  162       16.21  2.00  Female     No  Sun  Dinner     3
  164       17.51  3.00  Female    Yes  Sun  Dinner     2
  178        9.60  4.00  Female    Yes  Sun  Dinner     2
  186       20.90  3.50  Female    Yes  Sun  Dinner     3
  188       18.15  3.50  Female    Yes  Sun  Dinner     3),
 (('Female', 'Thur'),      total_bill   tip     sex smoker   day    time  size
  82        10.07  1.83  Female     No  Thur   Lunch     1
  85        34.83  5.17  Female     No  Thur   Lunch     4
  117       10.65  1.50  Female     No  Thur   Lunch     2
  118       12.43  1.80  Female     No  Thur   Lunch     2
  119       24.08  2.92  Female     No  Thur   Lunch     4
  121       13.42  1.68  Female     No  Thur   Lunch     2
  124       12.48  2.52  Female     No  Thur   Lunch     2
  125       29.80  4.20  Female     No  Thur   Lunch     6
  127       14.52  2.00  Female     No  Thur   Lunch     2
  128       11.38  2.00  Female     No  Thur   Lunch     2
  131       20.27  2.83  Female     No  Thur   Lunch     2
  132       11.17  1.50  Female     No  Thur   Lunch     2
  133       12.26  2.00  Female     No  Thur   Lunch     2
  134       18.26  3.25  Female     No  Thur   Lunch     2
  135        8.51  1.25  Female     No  Thur   Lunch     2
  136       10.33  2.00  Female     No  Thur   Lunch     2
  137       14.15  2.00  Female     No  Thur   Lunch     2
  139       13.16  2.75  Female     No  Thur   Lunch     2
  140       17.47  3.50  Female     No  Thur   Lunch     2
  143       27.05  5.00  Female     No  Thur   Lunch     6
  144       16.43  2.30  Female     No  Thur   Lunch     2
  145        8.35  1.50  Female     No  Thur   Lunch     2
  146       18.64  1.36  Female     No  Thur   Lunch     3
  147       11.87  1.63  Female     No  Thur   Lunch     2
  191       19.81  4.19  Female    Yes  Thur   Lunch     2
  197       43.11  5.00  Female    Yes  Thur   Lunch     4
  198       13.00  2.00  Female    Yes  Thur   Lunch     2
  201       12.74  2.01  Female    Yes  Thur   Lunch     2
  202       13.00  2.00  Female    Yes  Thur   Lunch     2
  203       16.40  2.50  Female    Yes  Thur   Lunch     2
  205       16.47  3.23  Female    Yes  Thur   Lunch     3
  243       18.78  3.00  Female     No  Thur  Dinner     2),
 (('Male', 'Fri'),      total_bill   tip   sex smoker  day    time  size
  90        28.97  3.00  Male    Yes  Fri  Dinner     2
  91        22.49  3.50  Male     No  Fri  Dinner     2
  95        40.17  4.73  Male    Yes  Fri  Dinner     4
  96        27.28  4.00  Male    Yes  Fri  Dinner     2
  97        12.03  1.50  Male    Yes  Fri  Dinner     2
  98        21.01  3.00  Male    Yes  Fri  Dinner     2
  99        12.46  1.50  Male     No  Fri  Dinner     2
  220       12.16  2.20  Male    Yes  Fri   Lunch     2
  222        8.58  1.92  Male    Yes  Fri   Lunch     1
  224       13.42  1.58  Male    Yes  Fri   Lunch     2),
 (('Male', 'Sat'),      total_bill    tip   sex smoker  day    time  size
  19        20.65   3.35  Male     No  Sat  Dinner     3
  20        17.92   4.08  Male     No  Sat  Dinner     2
  23        39.42   7.58  Male     No  Sat  Dinner     4
  24        19.82   3.18  Male     No  Sat  Dinner     2
  25        17.81   2.34  Male     No  Sat  Dinner     4
  26        13.37   2.00  Male     No  Sat  Dinner     2
  27        12.69   2.00  Male     No  Sat  Dinner     2
  28        21.70   4.30  Male     No  Sat  Dinner     2
  30         9.55   1.45  Male     No  Sat  Dinner     2
  31        18.35   2.50  Male     No  Sat  Dinner     4
  34        17.78   3.27  Male     No  Sat  Dinner     2
  35        24.06   3.60  Male     No  Sat  Dinner     3
  36        16.31   2.00  Male     No  Sat  Dinner     3
  38        18.69   2.31  Male     No  Sat  Dinner     3
  39        31.27   5.00  Male     No  Sat  Dinner     3
  40        16.04   2.24  Male     No  Sat  Dinner     3
  56        38.01   3.00  Male    Yes  Sat  Dinner     4
  58        11.24   1.76  Male    Yes  Sat  Dinner     2
  59        48.27   6.73  Male     No  Sat  Dinner     4
  60        20.29   3.21  Male    Yes  Sat  Dinner     2
  61        13.81   2.00  Male    Yes  Sat  Dinner     2
  62        11.02   1.98  Male    Yes  Sat  Dinner     2
  63        18.29   3.76  Male    Yes  Sat  Dinner     4
  64        17.59   2.64  Male     No  Sat  Dinner     3
  65        20.08   3.15  Male     No  Sat  Dinner     3
  68        20.23   2.01  Male     No  Sat  Dinner     2
  69        15.01   2.09  Male    Yes  Sat  Dinner     2
  70        12.02   1.97  Male     No  Sat  Dinner     2
  75        10.51   1.25  Male     No  Sat  Dinner     2
  76        17.92   3.08  Male    Yes  Sat  Dinner     2
  105       15.36   1.64  Male    Yes  Sat  Dinner     2
  106       20.49   4.06  Male    Yes  Sat  Dinner     2
  107       25.21   4.29  Male    Yes  Sat  Dinner     2
  108       18.24   3.76  Male     No  Sat  Dinner     2
  110       14.00   3.00  Male     No  Sat  Dinner     2
  170       50.81  10.00  Male    Yes  Sat  Dinner     3
  171       15.81   3.16  Male    Yes  Sat  Dinner     2
  206       26.59   3.41  Male    Yes  Sat  Dinner     3
  207       38.73   3.00  Male    Yes  Sat  Dinner     4
  208       24.27   2.03  Male    Yes  Sat  Dinner     2
  210       30.06   2.00  Male    Yes  Sat  Dinner     3
  211       25.89   5.16  Male    Yes  Sat  Dinner     4
  212       48.33   9.00  Male     No  Sat  Dinner     4
  216       28.15   3.00  Male    Yes  Sat  Dinner     5
  217       11.59   1.50  Male    Yes  Sat  Dinner     2
  218        7.74   1.44  Male    Yes  Sat  Dinner     2
  227       20.45   3.00  Male     No  Sat  Dinner     4
  228       13.28   2.72  Male     No  Sat  Dinner     2
  230       24.01   2.00  Male    Yes  Sat  Dinner     4
  231       15.69   3.00  Male    Yes  Sat  Dinner     3
  232       11.61   3.39  Male     No  Sat  Dinner     2
  233       10.77   1.47  Male     No  Sat  Dinner     2
  234       15.53   3.00  Male    Yes  Sat  Dinner     2
  235       10.07   1.25  Male     No  Sat  Dinner     2
  236       12.60   1.00  Male    Yes  Sat  Dinner     2
  237       32.83   1.17  Male    Yes  Sat  Dinner     2
  239       29.03   5.92  Male     No  Sat  Dinner     3
  241       22.67   2.00  Male    Yes  Sat  Dinner     2
  242       17.82   1.75  Male     No  Sat  Dinner     2),
 (('Male', 'Sun'),      total_bill   tip   sex smoker  day    time  size
  1         10.34  1.66  Male     No  Sun  Dinner     3
  2         21.01  3.50  Male     No  Sun  Dinner     3
  3         23.68  3.31  Male     No  Sun  Dinner     2
  5         25.29  4.71  Male     No  Sun  Dinner     4
  6          8.77  2.00  Male     No  Sun  Dinner     2
  7         26.88  3.12  Male     No  Sun  Dinner     4
  8         15.04  1.96  Male     No  Sun  Dinner     2
  9         14.78  3.23  Male     No  Sun  Dinner     2
  10        10.27  1.71  Male     No  Sun  Dinner     2
  12        15.42  1.57  Male     No  Sun  Dinner     2
  13        18.43  3.00  Male     No  Sun  Dinner     4
  15        21.58  3.92  Male     No  Sun  Dinner     2
  17        16.29  3.71  Male     No  Sun  Dinner     3
  41        17.46  2.54  Male     No  Sun  Dinner     2
  42        13.94  3.06  Male     No  Sun  Dinner     2
  43         9.68  1.32  Male     No  Sun  Dinner     2
  44        30.40  5.60  Male     No  Sun  Dinner     4
  45        18.29  3.00  Male     No  Sun  Dinner     2
  46        22.23  5.00  Male     No  Sun  Dinner     2
  47        32.40  6.00  Male     No  Sun  Dinner     4
  48        28.55  2.05  Male     No  Sun  Dinner     3
  49        18.04  3.00  Male     No  Sun  Dinner     2
  50        12.54  2.50  Male     No  Sun  Dinner     2
  53         9.94  1.56  Male     No  Sun  Dinner     2
  54        25.56  4.34  Male     No  Sun  Dinner     4
  55        19.49  3.51  Male     No  Sun  Dinner     2
  112       38.07  4.00  Male     No  Sun  Dinner     3
  113       23.95  2.55  Male     No  Sun  Dinner     2
  116       29.93  5.07  Male     No  Sun  Dinner     4
  150       14.07  2.50  Male     No  Sun  Dinner     2
  151       13.13  2.00  Male     No  Sun  Dinner     2
  152       17.26  2.74  Male     No  Sun  Dinner     3
  153       24.55  2.00  Male     No  Sun  Dinner     4
  154       19.77  2.00  Male     No  Sun  Dinner     4
  156       48.17  5.00  Male     No  Sun  Dinner     6
  159       16.49  2.00  Male     No  Sun  Dinner     4
  160       21.50  3.50  Male     No  Sun  Dinner     4
  161       12.66  2.50  Male     No  Sun  Dinner     2
  163       13.81  2.00  Male     No  Sun  Dinner     2
  165       24.52  3.48  Male     No  Sun  Dinner     3
  166       20.76  2.24  Male     No  Sun  Dinner     2
  167       31.71  4.50  Male     No  Sun  Dinner     4
  172        7.25  5.15  Male    Yes  Sun  Dinner     2
  173       31.85  3.18  Male    Yes  Sun  Dinner     2
  174       16.82  4.00  Male    Yes  Sun  Dinner     2
  175       32.90  3.11  Male    Yes  Sun  Dinner     2
  176       17.89  2.00  Male    Yes  Sun  Dinner     2
  177       14.48  2.00  Male    Yes  Sun  Dinner     2
  179       34.63  3.55  Male    Yes  Sun  Dinner     2
  180       34.65  3.68  Male    Yes  Sun  Dinner     4
  181       23.33  5.65  Male    Yes  Sun  Dinner     2
  182       45.35  3.50  Male    Yes  Sun  Dinner     3
  183       23.17  6.50  Male    Yes  Sun  Dinner     4
  184       40.55  3.00  Male    Yes  Sun  Dinner     2
  185       20.69  5.00  Male     No  Sun  Dinner     5
  187       30.46  2.00  Male    Yes  Sun  Dinner     5
  189       23.10  4.00  Male    Yes  Sun  Dinner     3
  190       15.69  1.50  Male    Yes  Sun  Dinner     2),
 (('Male', 'Thur'),      total_bill   tip   sex smoker   day   time  size
  77        27.20  4.00  Male     No  Thur  Lunch     4
  78        22.76  3.00  Male     No  Thur  Lunch     2
  79        17.29  2.71  Male     No  Thur  Lunch     2
  80        19.44  3.00  Male    Yes  Thur  Lunch     2
  81        16.66  3.40  Male     No  Thur  Lunch     2
  83        32.68  5.00  Male    Yes  Thur  Lunch     2
  84        15.98  2.03  Male     No  Thur  Lunch     2
  86        13.03  2.00  Male     No  Thur  Lunch     2
  87        18.28  4.00  Male     No  Thur  Lunch     2
  88        24.71  5.85  Male     No  Thur  Lunch     2
  89        21.16  3.00  Male     No  Thur  Lunch     2
  120       11.69  2.31  Male     No  Thur  Lunch     2
  122       14.26  2.50  Male     No  Thur  Lunch     2
  123       15.95  2.00  Male     No  Thur  Lunch     2
  126        8.52  1.48  Male     No  Thur  Lunch     2
  129       22.82  2.18  Male     No  Thur  Lunch     3
  130       19.08  1.50  Male     No  Thur  Lunch     2
  138       16.00  2.00  Male    Yes  Thur  Lunch     2
  141       34.30  6.70  Male     No  Thur  Lunch     6
  142       41.19  5.00  Male     No  Thur  Lunch     5
  148        9.78  1.73  Male     No  Thur  Lunch     2
  149        7.51  2.00  Male     No  Thur  Lunch     2
  192       28.44  2.56  Male    Yes  Thur  Lunch     2
  193       15.48  2.02  Male    Yes  Thur  Lunch     2
  194       16.58  4.00  Male    Yes  Thur  Lunch     2
  195        7.56  1.44  Male     No  Thur  Lunch     2
  196       10.34  2.00  Male    Yes  Thur  Lunch     2
  199       13.51  2.00  Male    Yes  Thur  Lunch     2
  200       18.71  4.00  Male    Yes  Thur  Lunch     3
  204       20.53  4.00  Male    Yes  Thur  Lunch     4)]

## Combining dataframes

There are many ways to combine various dataframes into a new one, extending in many ways what we already saw for operations on series. The main (among various) ways of doing this are: 

+ Concatenate: paste row-column-wise and taking action on NaNs
    + This works more on the rectangular structure of the data 
+ Merge: combine dataframes using a common piece of information, e.g. a common column
    + This works more as a database operation

### Concatenate

```python
pd.concat([df1,df2,...] , axis = 0 , join = "outer", *keywds) 
```

+ axis: 0 for pasting below, 1 for pasting on the side (order in list matters either way) 

What do you think will happen in the following case? 

```python
df1 = pd.DataFrame({"A": pd.Series([1,2,3]), "B": pd.Series([4,5,6])})
df2 = pd.DataFrame({"A": pd.Series([4]), "C": pd.Series([7])})
df = pd.concat([df1,df2])
print(df.loc[0])
```

The argument *join* can control the decisions to be taken in concatenating dataframes with key or index incompatibility. 

+ join: "outer" union, "inner" intersection 

What do you think will happen if we replace the concatenation step by: 

```python
df = pd.concat([df1,df2], join = "inner")
print(df.loc[0])
```

And what about this code? 

```python
df1 = pd.DataFrame({"A": pd.Series([1,2,3]), "B": pd.Series([4,5,6])})
df2 = pd.DataFrame({"A": pd.Series([4]), "C": pd.Series([7])})
df = pd.concat([df1,df2],axis = 1,join = "inner")
print(df["A"])
```

### Merge

The concept here is to connect two DataFrames on some common piece of information, e.g. a common column. The structure of the command is: 

```python
pd.merge(leftdf, rightdf, how = "inner", on = , *keywds)  
```

+ "on" defines on what piece of information the DataFrames will merge, this can be a column name or a list thereof
+ "how" is more versatile than "join" in pd.concat. There are four options:
    + "inner": intersection of keys
    + "outer": union of keys
    + "left": use keys from left only
    + "right": use keys from right only


We revisit the previous construct and try now to merge instead. What do you think will happen below: (and what about the index labels now, compared to pd.concat??) 

```python
df1 = pd.DataFrame({"A": pd.Series([1,2,3]), "B": pd.Series([4,5,6])})
df2 = pd.DataFrame({"A": pd.Series([4]), "C": pd.Series([7])})
df = pd.merge(df1,df2,on = "A", how = "outer")
print(df)
```
and what will happen if "how" changes to each of the other options?

## Working with non-rectangular data

We mentioned in the beginning that Pandas is a library for working with rectangular data. 

What if your data is not rectangular? What does non-rectangular data look like? Very often our data might come in dictionaries. Imagine data about a "tweet". It might look like this: 


```python
{
    "screenname": "nandanrao",
    "id_str": "928374987",
    "text": "Woah, pandas is so much fun #worldrocked #jawdrop #win",
    "hashtags": ["worldrocked", "jawdrop", "win"]
}
```

How would you fit this into a rectangular data format? Do the "hashtags" cause a problem?

In [46]:
raw_tweets = [{ "screenname": "nandanrao",
          "id_str": "928374987",
          "text": "Woah, pandas is so much fun #worldrocked #jawdrop #ml",
          "hashtags": ["worldrocked", "jawdrop", "ml"]},
          {"screenname": "om",
           "id_str": "98214039",
           "text": "I eat linear models for breakfast #datascience #ml #crossfit",
           "hashtags": ["datascience", "ml", "crossfit"]}]

tweets = pd.DataFrame(raw_tweets)

# What is the "hashtag" column made of? 
tweets

,screenname,id_str,text,hashtags
0,nandanrao,928374987,"Woah, pandas is so much fun #worldrocked #jawd...","[worldrocked, jawdrop, ml]"
1,om,98214039,I eat linear models for breakfast #datascience...,"[datascience, ml, crossfit]"

## Merge keeps the data flat

The correct way to use data such as this in pandas, data with nested lists, is to copy each tweet to multiple rows, one row for each hashtag. 

We can use "merge" to do this for us automatically if we put the data into two separate dataframes, one for the hashtags and one for the rest of the tweets. This is called "normalized form" and is often how you will find data if you get it from a SQL database:

In [47]:
tweets = pd.DataFrame(raw_tweets, columns = ["screenname", "id_str", "text"])
tweets

  screenname     id_str                                               text
0  nandanrao  928374987  Woah, pandas is so much fun #worldrocked #jawd...
1         om   98214039  I eat linear models for breakfast #datascience...

In [48]:
tags_and_ids = [(t['id_str'], tag) 
                for t in raw_tweets 
                for tag in t['hashtags']]

hashtags = pd.DataFrame(tags_and_ids, columns = ['id_str', 'hashtag'])

hashtags

      id_str      hashtag
0  928374987  worldrocked
1  928374987      jawdrop
2  928374987           ml
3   98214039  datascience
4   98214039           ml
5   98214039     crossfit

In [49]:
df = tweets.merge(hashtags, how='left')

df

,screenname,id_str,text,hashtag
0,nandanrao,928374987,"Woah, pandas is so much fun #worldrocked #jawd...",worldrocked
1,nandanrao,928374987,"Woah, pandas is so much fun #worldrocked #jawd...",jawdrop
2,nandanrao,928374987,"Woah, pandas is so much fun #worldrocked #jawd...",ml
3,om,98214039,I eat linear models for breakfast #datascience...,datascience
4,om,98214039,I eat linear models for breakfast #datascience...,ml
5,om,98214039,I eat linear models for breakfast #datascience...,crossfit

## Programming project: Customer of the month


- We have a list of prices for certain products given in the file "supermarket_prices.csv"
- We have a list of transactions from certain customers in a period of a month given in "supermarket_transactions.csv"

Calculate
- How many items each client has purchased
- How many items of each type each client has purchased
- Calculate the total amount spent by each client
- The company that provides the supermarket with bananas wishes to give a prize to the client that has spent the largest proportion of their spending on bananas. Who should win the prize? 
- A marketing company that works with the supermarket is interested to understand better the characteristics of the three people that have spent most of their spending on bananas. For each one of them report the other product that they have spent most of their remaining income on

*Needless to say that eyeballing is OK for making sure your code makes sense, but will not result in full credits for the project. We want a fully automated code. To carry out the project successfully you need to use most the attributes and methods described earlier. The last one is a little tricky*

In [55]:
supermarket_prices = pd.read_csv("supermarket_prices.csv")
supermarket_transactions = pd.read_csv("supermarket_transactions.csv")
supermarket_transactions.head()

     Buyer Product  Quantity
0  Jackson   apple         4
1  Jackson   apple         9
2     John  orange         9
3     John  potato        10
4      Tom  tomato         4

In [66]:
#How many items each client has purchased
supermarket_transactions.groupby('Buyer').sum()

         Quantity
Buyer
Emma           81
Jackson        70
John          122
Liam           81
Lucas          62
Sandra         78
Sophia         61
Tom            49

In [68]:
#How many items of each type each client has purchased
by_client_type = supermarket_transactions.groupby(['Buyer','Product']).sum()
by_client_type

In [95]:
#Calculate the total amount spent by each client
merged_tables = pd.merge(supermarket_transactions, supermarket_prices, on = 'Product', how = 'outer')
merged_tables['total_spent'] = merged_tables.Quantity*merged_tables.Price
client_spent = merged_tables[['Buyer','total_spent']].groupby(['Buyer']).sum()
client_spent

         total_spent
Buyer
Emma           246.4
Jackson        202.8
John           461.3
Liam           263.3
Lucas          176.0
Sandra         300.8
Sophia         189.4
Tom            126.1

In [111]:
#The company that provides the supermarket with bananas wishes to give a prize to the client that 
#has spent the largest proportion of their spending on bananas. Who should win the prize?

merged_banana = merged_tables[merged_tables.Product=='banana']
spent_banana = merged_banana[['Buyer','total_spent']].groupby('Buyer').sum()
spent_banana_total = pd.merge(spent_banana,client_spent, on = 'Buyer', how = 'inner')
spent_banana_total['prop_banana'] = spent_banana_total['total_spent_x']/spent_banana_total['total_spent_y']
spent_banana_total.prop_banana.idxmax()

'Emma'

In [163]:
#A marketing company that works with the supermarket is interested to understand better the 
#characteristics of the three people that have spent most of their spending on bananas. 
#For each one of them report the other product that they have spent most of their remaining income on.
top_three = spent_banana_total.prop_banana.sort_values()[-4:-1].index.values
spending = pd.DataFrame()
for person in top_three:
    spending = pd.concat([spending, merged_tables[merged_tables.Buyer == person]],axis=0)
spent_buyer_prod = spending.groupby(['Buyer','Product']).sum().reset_index()[['Buyer','Product','total_spent']]
total_buyer_prod = pd.merge(spent_buyer_prod,client_spent,on='Buyer',how='left')
total_buyer_prod['prop'] = total_buyer_prod.total_spent_x/total_buyer_prod.total_spent_y
total_buyer_prod[['Buyer','Product','prop']][total_buyer_prod.Product!='banana']
#Not Complete

     Buyer Product      prop
0     John   apple  0.018209
2     John  orange  0.428788
3     John  potato  0.132669
4     John  tomato  0.104704
5     Liam   apple  0.095708
7     Liam  orange  0.261299
8     Liam  potato  0.271174
9     Liam  tomato  0.055830
10  Sophia   apple  0.088701
12  Sophia  orange  0.158923
13  Sophia  potato  0.251320
14  Sophia  tomato  0.144139

In [149]:
?pd.merge
spent_buyer_prod

                Quantity  Price  total_spent
Buyer  Product
John   apple           7    1.2          8.4
       banana         28   20.8        145.6
       orange         46   30.1        197.8
       potato         18    6.8         61.2
       tomato         23    6.3         48.3
Liam   apple          21    3.6         25.2
       banana         16   20.8         83.2
       orange         16    8.6         68.8
       potato         21   10.2         71.4
       tomato          7    2.1         14.7
Sophia apple          14    3.6         16.8
       banana         13   15.6         67.6
       orange          7    8.6         30.1
       potato         14    6.8         47.6
       tomato         13    4.2         27.3